---
kind: method
id: M:Autodesk.Revit.DB.ElevationMarker.HasElevations
source: html/e40ae5a5-57d0-bf4b-00bf-c5b185aeaeac.htm
---
# Autodesk.Revit.DB.ElevationMarker.HasElevations Method

Returns true if the ElevationMarker has at least one elevation view, false otherwise.

## Syntax (C#)
```csharp
public bool HasElevations()
```

## Returns
True if the ElevationMarker has at least one elevation view, false otherwise.